САБ/Documents/CW_ДоходыПоГрузоперевозке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>CW_ДоходыПоГрузоперевозке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйСчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокКонтейнеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВедомыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособЗачетаАвансовОЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВводОстатковБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВводОстатковОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособЗачетаАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормируетсяСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорректируемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

САБ/Documents/CW_ДоходыПоГрузоперевозке/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура саб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	НовыйЭлемент = Элементы.Добавить("СписокКонтейнеров", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.ПутьКДанным = "Список.СписокКонтейнеров";
	НовыйЭлемент.Заголовок = "Список контейнеров";
	//
	НомерСимволаДляВставки = СтрНайти(ЭтаФорма.Список.ТекстЗапроса,"ВЫБРАТЬ"+Символы.ПС) + 6;	
	ЭтаФорма.Список.ТекстЗапроса = ВМС_ВставитьСтрокуВСтроку(ЭтаФорма.Список.ТекстЗапроса,Символы.ПС + "	ПоследняяДатаДоставкиНаСклад.ВМС_ДатаДоставкиНаСклад КАК ВМС_ДатаДоставкиНаСклад,",НомерСимволаДляВставки);	
	//НомерСимволаДляВставки = СтрНайти(ЭтаФорма.Список.ТекстЗапроса,"ВЫБРАТЬ"+Символы.ПС) + 6;	
	
	ТекстЗапросаЛевоеСоединение = "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяДатаДоставкиНаСклад КАК ПоследняяДатаДоставкиНаСклад
		|		ПО ДокументCW_ДоходыПоГрузоперевозке.Ссылка = ПоследняяДатаДоставкиНаСклад.Ссылка";
	
	ПозицияХарактеристики = СтрНайти(ЭтаФорма.Список.ТекстЗапроса,Символы.ПС+"{ХАРАКТЕРИСТИКИ"); 
	
	
	Если ПозицияХарактеристики <> 0 тогда                                                   
		ЭтаФорма.Список.ТекстЗапроса = Лев(ЭтаФорма.Список.ТекстЗапроса,ПозицияХарактеристики-1) + ТекстЗапросаЛевоеСоединение + Прав(ЭтаФорма.Список.ТекстЗапроса,СтрДлина(ЭтаФорма.Список.ТекстЗапроса) - ПозицияХарактеристики+1);
	Иначе 
		ЭтаФорма.Список.ТекстЗапроса = ЭтаФорма.Список.ТекстЗапроса + ТекстЗапросаЛевоеСоединение
	КонецЕсли;
	
	ЭтаФорма.Список.ТекстЗапроса = 	
	"ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(Т_ДатаДоставкиНаСклад.Значение КАК ДАТА)) КАК ВМС_ДатаДоставкиНаСклад
	|ПОМЕСТИТЬ ПоследняяДатаДоставкиНаСклад
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК Т_ДатаДоставкиНаСклад
	|		ПО CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка = Т_ДатаДоставкиНаСклад.Грузоперевозка
	|			И (Т_ДатаДоставкиНаСклад.Параметр = &ПВХ_ДатаДоставкиНаСклад)
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка;" + Символы.ПС + ЭтаФорма.Список.ТекстЗапроса;
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ПВХ_ДатаДоставкиНаСклад",ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.НайтиПоКоду("000010043"));
	
	Элементы.Добавить("ВМС_ДатаДоставкиНаСклад", Тип("ПолеФормы"),Элементы.Список);  
	
	Элементы.ВМС_ДатаДоставкиНаСклад.ПутьКДанным = "Список.ВМС_ДатаДоставкиНаСклад";
	Элементы.ВМС_ДатаДоставкиНаСклад.Заголовок = "Дата доставки на склад";
	Элементы.ВМС_ДатаДоставкиНаСклад.Формат = "ДФ=dd.MM.yyyy";
	Элементы.ВМС_ДатаДоставкиНаСклад.Ширина = 8;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВМС_ВставитьСтрокуВСтроку(Знач Текст, Знач СтрокаДляВставки, Знач НомерСимволаДляВставки)
	Возврат Лев(Текст,НомерСимволаДляВставки) + СтрокаДляВставки + Прав(Текст, СтрДлина(Текст)-НомерСимволаДляВставки);
КонецФункции
